from gtts import gTTS

tts = gTTS(text='Hello', lang='en', slow=True)
tts.save("d:/tmp/hello.mp3")

#input = str('استكمال الدور الريادي لقناة الجزيرة في تطوير الرسالة الإعلامية العربية المرئية والمقروءة، وتمكين الجمهور العربي من المتابعة التفاعلية المتواصلة للأخبار والبرامج وتحليلاتها على شبكة الإنترنت، وزيادة عدد متابعي أنشطة قناة الجزيرة عبر موقعها على الإنترنت إضافة لجمهور الشاشة.', 'utf-8')
input = 'يُشارُ إِلَى أَنَّ اللُّغَةَ العَرَبيَّةَ يَتَحَدَّثَها أَكْثَرَ مِنْ 422 مِلْيونَ نَسَمَةٍ وَيَتَوَزَّعُ متحدثوها في المِنْطَقَةِ المَعْروفَةِ بِاسْمِ الوَطَنِ العَرَبيِّ بِالْإِضافَةِ إِلَى العَديدِ مِنْ المَناطِقِ الأُخْرَى المُجاوِرَةِ مِثْلَ الأَهْوازِ وَتُرْكيا وَتِشادَ والسِّنْغالِ وَإِريتْريا وَغَيْرِها . وَهيَ اللُّغَةُ الرّابِعَةُ مِنْ لُغاتِ مُنَظَّمَةِ الأُمَمِ المُتَّحِدَةِ الرَّسْميَّةِ السِّتِّ .'
input2 = 'يُشار إلى أن اللغة العربية يتحدثها أكثر من 422 مليون نسمة ويتوزع متحدثوها في المنطقة المعروفة باسم الوطن العربي بالإضافة إلى العديد من المناطق الأخرى المجاورة مثل الأهواز وتركيا وتشاد والسنغال وإريتريا وغيرها. وهي اللغة الرابعة من لغات منظمة الأمم المتحدة الرسمية الست.'
tts = gTTS(text=input, lang='ar', slow=False)
tts.save("d:/tmp/arabic.mp3")
tts = gTTS(text=input2, lang='ar', slow=False)
tts.save("d:/tmp/arabic2.mp3")
